package Module1;

/*
1. Создать собственный репозиторий на GitHub
2. Настроить git ignore
3. Написать программу которая выводит в консоль текст на тему "Как я проведу лето 2017"
4. Запушить исходный код программы на репозиторий

Результат ДЗ:
Как свое решение ДЗ в обучающую систему загружай ссылку на GitHub.
Как пользоватся GitHub можешь посмотреть в инструкции в Вступительном Модуле .
*/

public class Homework1 {

    public static void main(String[] args) {

        System.out.println("How I am going to spend summer of 2017");

        System.out.println("Learning Java, obviously!");
    }
}
